#### BuiltInFailures.ColorFillFailures Members

---

|  |
| --- |
| BuiltInFailures ColorFillFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ColorFillFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | OnlyOneColorFillNonPlan | A Color Fill Legend can only be placed in a Floor Plan View or a Section View. |
| Public property Static member | SymtemColorFillLegendNotAllowed | [Category name] Color Fill Legend can only be placed in a Floor Plan View. |

# See Also

BuiltInFailures ColorFillFailures Class

Autodesk.Revit.DB Namespace